app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
	def index
		#select all
		@articles = Article.all#llama todos los registros de la tabla article

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`) VALUES ('LOL ', 'PUTA VIDA APUTA VIDA APUTA VIDA APUTA VIDA A', '2018-10-23 02:19:12', '2018-10-23 02:19:12')
---
	def create
		#Insert into
		@article= Article.new(article_params)

		if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "adsdasddasdasdadsadasdasdasdaa"], ["updated_at", "2018-07-29 17:25:00.196171"], ["id", 2]]
---
	def update
		#@article.update_attibutes({title: 'Nuevo titulo'})
		@article = Article.find(params[:id])
		if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 3]]
---
	def destroy
		@article = Article.find(params[:id])
		@article.destroy #Elimina el objeto de la base de datos